
@rem ================================================================================
@rem имя, общее для фрагмента и манифеста (должно включать путь)
@rem перемещает из recording_dir в process_dir
@rem ================================================================================

@set recording_dir=%3
@set process_dir=%2
@set param=%1
@set filename=%param:~0,17%
@echo file name: %filename%
@echo process_dir: %process_dir%
@echo recording_dir: %recording_dir%

@rem ================================================================================
@rem перемещение файлов в папку обработки
@rem ================================================================================
@move /Y %recording_dir%\%filename%.mp4  %process_dir%\%filename%.mp4

@rem ================================================================================
@rem создание манифеста
@rem ================================================================================
@VideoFragmentManifestMaker %process_dir%\%filename%.mp4

@rem задано время, близкое ко времени обработки файла
@timeout 20

@set filename=
@set param=
@set process_dir=
@set recording_dir=

@rem для завершения запускающего процесса нужно вызывать без /B
@exit 0


